Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAreaAttributes.AreaElementTypeEnum Enumeration
 The area element types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AreaElementTypeEnum
Public Enumeration AreaElementTypeEnum
Members
Member name | Value | Description
AREA_ELEMENT_TYPE_TRIANGULAR | 0 |  The triangular area element type.
AREA_ELEMENT_TYPE_QUADRILATERAL | 1 |  The quadrilateral area element type.
See Also
Reference
Tekla.Structures.Analysis Namespace